MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM3U6FWFG/mcu.h
/* Analog-to-Digital Converter (AD) */
#define TSB_AD_MOD0_ADSS                          (*((__O  uint32_t *)BITBAND_PERI(&TSB_AD->MOD0,0)))
#define TSB_AD_MOD0_DACON                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD0,1)))
#define TSB_AD_MOD1_ADAS                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD1,0)))
#define TSB_AD_MOD1_ADEN                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD1,7)))
#define TSB_AD_MOD2_ADBFN                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->MOD2,0)))
#define TSB_AD_MOD2_ADSFN                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->MOD2,1)))
#define TSB_AD_CMPCR0_ADBIG0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->CMPCR0,4)))
#define TSB_AD_CMPCR0_CMP0EN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->CMPCR0,7)))
#define TSB_AD_CMPCR1_ADBIG1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->CMPCR1,4)))
#define TSB_AD_CMPCR1_CMP1EN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->CMPCR1,7)))
#define TSB_AD_PSEL0_PENS0                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSEL0,7)))
#define TSB_AD_PSEL1_PENS1                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSEL1,7)))
#define TSB_AD_PSEL2_PENS2                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSEL2,7)))
#define TSB_AD_PSEL3_PENS3                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSEL3,7)))
#define TSB_AD_PSET0_ENSP00                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET0,7)))
#define TSB_AD_PSET0_ENSP01                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET0,15)))
#define TSB_AD_PSET0_ENSP02                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET0,23)))
#define TSB_AD_PSET0_ENSP03                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET0,31)))
#define TSB_AD_PSET1_ENSP10                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET1,7)))
#define TSB_AD_PSET1_ENSP11                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET1,15)))
#define TSB_AD_PSET1_ENSP12                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET1,23)))
#define TSB_AD_PSET1_ENSP13                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET1,31)))
#define TSB_AD_PSET2_ENSP20                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET2,7)))
#define TSB_AD_PSET2_ENSP21                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET2,15)))
#define TSB_AD_PSET2_ENSP22                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET2,23)))
#define TSB_AD_PSET2_ENSP23                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET2,31)))
#define TSB_AD_PSET3_ENSP30                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET3,7)))
#define TSB_AD_PSET3_ENSP31                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET3,15)))
#define TSB_AD_PSET3_ENSP32                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET3,23)))
#define TSB_AD_PSET3_ENSP33                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET3,31)))
#define TSB_AD_PSET4_ENSP40                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET4,7)))
#define TSB_AD_PSET4_ENSP41                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET4,15)))
#define TSB_AD_PSET4_ENSP42                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET4,23)))
#define TSB_AD_PSET4_ENSP43                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET4,31)))
#define TSB_AD_PSET5_ENSP50                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET5,7)))
#define TSB_AD_PSET5_ENSP51                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET5,15)))
#define TSB_AD_PSET5_ENSP52                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET5,23)))
#define TSB_AD_PSET5_ENSP53                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->PSET5,31)))
#define TSB_AD_TSET03_ENST0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->TSET03,7)))
#define TSB_AD_TSET03_ENST1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->TSET03,15)))
#define TSB_AD_TSET03_ENST2                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->TSET03,23)))
#define TSB_AD_TSET03_ENST3                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->TSET03,31)))
#define TSB_AD_TSET47_ENST4                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->TSET47,7)))
#define TSB_AD_TSET47_ENST5                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->TSET47,15)))
#define TSB_AD_TSET47_ENST6                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->TSET47,23)))
#define TSB_AD_TSET47_ENST7                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->TSET47,31)))
#define TSB_AD_TSET811_ENST8                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->TSET811,7)))
#define TSB_AD_TSET811_ENST9                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->TSET811,15)))
#define TSB_AD_TSET811_ENST10                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->TSET811,23)))
#define TSB_AD_TSET811_ENST11                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->TSET811,31)))
#define TSB_AD_SSET03_ENSS0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->SSET03,7)))
#define TSB_AD_SSET03_ENSS1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->SSET03,15)))
#define TSB_AD_SSET03_ENSS2                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->SSET03,23)))
#define TSB_AD_SSET03_ENSS3                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->SSET03,31)))
#define TSB_AD_SSET47_ENSS4                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->SSET47,7)))
#define TSB_AD_SSET47_ENSS5                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->SSET47,15)))
#define TSB_AD_SSET47_ENSS6                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->SSET47,23)))
#define TSB_AD_SSET47_ENSS7                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->SSET47,31)))
#define TSB_AD_SSET811_ENSS8                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->SSET811,7)))
#define TSB_AD_SSET811_ENSS9                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->SSET811,15)))
#define TSB_AD_SSET811_ENSS10                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->SSET811,23)))
#define TSB_AD_SSET811_ENSS11                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->SSET811,31)))
#define TSB_AD_ASET03_ENSA0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->ASET03,7)))
#define TSB_AD_ASET03_ENSA1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->ASET03,15)))
#define TSB_AD_ASET03_ENSA2                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->ASET03,23)))
#define TSB_AD_ASET03_ENSA3                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->ASET03,31)))
#define TSB_AD_ASET47_ENSA4                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->ASET47,7)))
#define TSB_AD_ASET47_ENSA5                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->ASET47,15)))
#define TSB_AD_ASET47_ENSA6                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->ASET47,23)))
#define TSB_AD_ASET47_ENSA7                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->ASET47,31)))
#define TSB_AD_ASET811_ENSA8                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->ASET811,7)))
#define TSB_AD_ASET811_ENSA9                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->ASET811,15)))
#define TSB_AD_ASET811_ENSA10                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->ASET811,23)))
#define TSB_AD_ASET811_ENSA11                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->ASET811,31)))
#define TSB_AD_MOD3_RCUT                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD3,8)))


/* Watchdog Timer (WD) */
#define TSB_WD_MOD_RESCR                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_WD->MOD,1)))
#define TSB_WD_MOD_I2WDT                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_WD->MOD,2)))
#define TSB_WD_MOD_WDTE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_WD->MOD,7)))


/* Real Time Clock (RTC) */
#define TSB_RTC_MONTHR_MO0                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_RTC->MONTHR,0)))


